// ==========================================================================================================
// вспомогательные абстрактные функции
//
// не должен зависеть от других модулей
//
// группа загрузки: 0
//
// текущие зависимости: нету
//
// ==========================================================================================================

function getRandomInt(min, max) {
	return Math.floor(Math.random() * (max - min + 1)) + min;
}

function getRandom(min, max) {
	return Math.random() * (max - min) + min;
}
