// ==========================================================================================================
// ядро системы
// весь запуск идет отсюда, модули сами ничего не делают
//
// группа загрузки: последняя
//
// текущие зависимости: constants, parameters, abstracts, world, interpretate, graphics, renderer, interaction, palettes
//
// ==========================================================================================================

// ==========================================================================================================
// инициализация независимо от загрузки страницы
// ==========================================================================================================


// ==========================================================================================================
// стартовая точка, когда страница загрузилась
// ==========================================================================================================
$(document).ready(function() {
	makeSnakesEditor();
	document.addEventListener('keydown', function(e) {
		if ($("#battle").hasClass("hidden")) {
			return;
		}
		if (e.code === "Space") {
			if (timer === undefined) {
				battleStart()
			} else {
				battlePause();
			}
		} else if (e.code === "ArrowRight") {
			battlePause();
			oneStep();
		} else if (e.code === "ArrowLeft") {
			battlePause();
			backStep();
		}
	})
});